In [1]:
import pandas as pd

In [5]:
df1 = pd.DataFrame ({
    'name':['bob','harley','harry','peter'],
    'age':[23,24,23,27]
})
df2 = pd.DataFrame ({
    'name':['hopper','butler','ricky','pattison'],
    'age':[25,24,23,29]
})

In [6]:
pd.concat([df1,df2])

       name  age
0       bob   23
1    harley   24
2     harry   23
3     peter   27
0    hopper   25
1    butler   24
2     ricky   23
3  pattison   29

In [7]:
pd.concat([df1,df2],axis = 0)

       name  age
0       bob   23
1    harley   24
2     harry   23
3     peter   27
0    hopper   25
1    butler   24
2     ricky   23
3  pattison   29

In [8]:
pd.concat([df1,df2],axis = 1)

     name  age      name  age
0     bob   23    hopper   25
1  harley   24    butler   24
2   harry   23     ricky   23
3   peter   27  pattison   29

In [9]:
df2 = pd.DataFrame ({
    'name': ['james','suresh','ramesh'],
    'maths':[76,67,82],
    'science':[86,72,69]
})

In [10]:
pd.melt(df2)

  variable   value
0     name   james
1     name  suresh
2     name  ramesh
3    maths      76
4    maths      67
5    maths      82
6  science      86
7  science      72
8  science      69

In [26]:
pd.melt(df2,id_vars ='name',var_name = 'subject',value_name = 'marks' )

     name  subject  marks
0   james    maths     76
1  suresh    maths     67
2  ramesh    maths     82
3   james  science     86
4  suresh  science     72
5  ramesh  science     69